// const String pText = "隱私權政策\n\n"
//     "肌動GO（以下簡稱本服務）是由「台北商業大學111406專題組」（以下簡稱本團隊）所建置。本團隊係依照以下服務條款之約定（以下稱「本條款」），提供本團隊之肌動GO使用者（下稱「本服務使用者」）使用本團隊之各項網路資訊服務（以下簡稱「網路資訊服務」），欲使用本分公司之各項網路資訊服務者請務必詳細閱讀本條款相關內容以保障權益，當本服務使用者已開始使用本分公司之各項網路資訊服務時，視為服務使用者已確實閱讀、瞭解並同意遵守本條款。本服務使用者於本條款為任何修改或變更後仍繼續使用本分公司之各項網路資訊服務時，視為使用者已確實閱讀、瞭解並同意遵守本條款之修改或變更。\n\n"
//     "一、隱私權保護政策的適用範圍\n\n"
//     "隱私權保護政策內容，包括本服務如何處理在您使用本團隊之各項網路資訊服務時收集到的個人識別資料。\n"
//     "隱私權保護政策不適用於本服務以外的相關連結，也不適用於非本服務所委託或參與管理的人員。 \n\n"
//     "二、資料的蒐集與使用方式\n\n"
//     "為了在本服務上提供您最佳互動性服務，可能會請您提供相關個人的資料，其範圍如下: \n"
//     "於一般瀏覽時，伺服器會自行記錄相關行徑，包括您使用時間、瀏覽及點選資料記錄等，做為我們增進本團隊之各項網路資訊服務的參考依據，此記錄為內部應用，決不對外公布。\n"
//     "除非取得您的同意或其他法令之特別規定，本服務絕不會將您的個人資料揭露於第三人或使用於蒐集目的以外之其他用途。 \n"
//     "以下針對收集的資料類型、收集這些資料的原因以及些資料的用途說明： \n"
//     "個人資料之類別：\n"
//     "1. 辨識個人者：如您的姓名、出生年月日、電子郵件信箱地址等。\n"
//     "2. 政府資料中之辨識者：如身分證統一編號、護照號碼等。 \n"
//     "3. 個人描述：如年齡、性別等。 \n"
//     "4. 身體描述：如血壓值、血糖值、身高、體重等。 \n\n"
//     "三、資料之保護\n\n"
//     "本服務主機均設有防火牆、防毒系統等相關的各項資訊安全設備及必要的安全防護措施，加以保護服務及您的個人資料。\n\n"
//     "四、服務對外的相關連結\n\n"
//     "本服務提供其他服務之網路連結，您也可經由本服務所提供的連結，點選進入其他服務。但該連結之服務不適用於本服務的隱私權保護政策，您必須參考該連結之服務的隱私權保護政策。\n\n"
//     "五、隱私權保護政策之修正\n\n"
//     "本服務隱私權保護政策將因應需求隨時進行修正，修正後的條款將刊登於服務上。\n\n"
//     "七、服務之停止或終止\n\n"
//     "1. 本服務如發生下列情形之一時，本分公司有權不經通知逕行停止或中斷提供服務，如因此致用戶或第三人產生困擾、不便或損害，均不負任何法律責任：\n"
//     "對電子通信設備進行必要之保養及施工時。 \n"
//     "發生突發性之電子通信設備故障時。\n"
//     "由於所申請之電子通信服務因任何原因被停止，無法提供服務時。\n"
//     "由於天災等不可抗力之因素致無法提供服務時。\n"
//     "對於本服務相關系統設備進行遷移、更換或維護時。\n"
//     "因不可歸責於本分公司事由所造成服務之停止或中斷。\n"
//     "因不可抗力所造成服務之停止或中斷。\n"
//     "2. 基於網際網路之特性，本服務使用者瞭解並同意於使用本分公司之各項網路資訊服務時，應自行採取防護措施，如因本分公司、協力廠商或相關電信業者網路系統軟硬體設備之故障、失靈或人為操作上之疏失而致本團隊之各項網路資訊服務全部或一部中斷、暫時無法使用、遲延、或造成資料傳輸或儲存上之漏誤、或遭第三人侵入系統篡改偽造資料時，本分公司不負任何賠償責任。\n"
//     "3. 如本服務使用者有違反本條款或相關法令或有其他不當使用之情形發生時，本分公司得不經催告逕行加以限制或終止其使用本團隊之各項網路資訊服務之權利，用戶不得因此要求補償或賠償。\n\n"
//     "八、擔保責任免除及責任限制\n\n"
//     "本分公司就各項網路資訊服務，不負擔任何明示或默示之擔保責任，亦不保證各項服務之穩定、安全、無誤、及不中斷。\n"
//     "本分公司不保證使用各項網路資訊服務之結果或經由本分公司服務獲得之資訊符合用戶之期望，亦不保證用戶不會因此接觸到不適當之內容。\n"
//     "本服務使用者如無法使用本服務時，其所致之任何直接、間接、衍生、或特別損害等，本分公司均不負任何賠償責任。若本服務使用者使用之服務係屬有價者，本分公司僅於本服務使用者所付對價範圍內負賠償責任。但前述賠償責任限制，若依法不得限制者，則限制規定將不予適用。\n\n"
//     "九、權利歸屬及智慧財產權\n\n"
//     "本分公司服務上所使用或提供之軟體、程式及內容（包括但不限於文字、說明、圖畫、圖片、圖形、檔案、頁面設計、服務規劃與安排等）之專利權、著作權、商標權、營業秘密、專門技術及其他智慧財產權均屬本團隊或其他權利人所有，非經權利人事先書面授權同意，本服務使用者不得重製、公開傳播、公開播送、公開上映、改作、編輯、出租、散布、進行還原工程、解編、反向組譯、或其他方式之使用，如有違反，除應自行負法律責任外，如因而對本團隊造成損害或損失，本團隊有權向該服務使用者請求損害賠償。\n\n"
//     "十、準據法及管轄法院\n\n"
//     "關於本條款之解釋或適用，以中華民國之法律為準據法。\n"
//     "本服務使用者因使用本服務而與本團隊所生之爭議，同意依誠信原則解決之，如有訴訟之必要時，同意以台灣台北地方法院為第一審管轄法院。\n\n"
//     "十一、本條款修訂之權利\n\n"
//     "本團隊有權隨時修訂本條款及相關告知事項，並隨時透過本服務公佈公告之，修正之內容自公告時起生效，不另行個別通知，本服務使用者不得因此而要求任何補償或賠償。";

const String privateText = """
隱私權政策

肌動GO（以下簡稱本服務）是由「台北商業大學資訊管理系111406專題組」（以下簡稱本團隊）所建置。本團隊係依照以下服務條款之約定（以下稱「本條款」），提供本團隊之肌動GO使用者（下稱「本服務使用者」）使用本團隊之各項網路資訊服務（以下簡稱「網路資訊服務」）。


一、隱私權保護政策的適用範圍

隱私權保護政策內容，包括本服務如何處理在您使用本團隊之各項網路資訊服務時收集到的個人識別資料。
隱私權保護政策不適用於本服務以外的相關連結，也不適用於非本服務所委託或參與管理的人員。


二、資料的蒐集與使用方式

為了在本服務上提供您最佳互動性服務，可能會請您提供相關個人的資料，其範圍如下
於一般瀏覽時，伺服器會自行記錄相關行徑，包括您使用時間、瀏覽及點選資料記錄等，做為我們增進本團隊之各項網路資訊服務的參考依據，此記錄為內部應用，決不對外公布。
除非取得您的同意或其他法令之特別規定，本服務絕不會將您的個人資料揭露於第三人或使用於蒐集目的以外之其他用途。
以下針對收集的資料類型、收集這些資料的原因以及些資料的用途說明：
個人資料之類別：
1. 辨識個人者：如出生年月日、電子郵件信箱地址等。
2. 個人描述：如年齡、性別等。
3. 身體描述：如三高(血壓值、血糖值、血脂質)、身高、體重等。


三、服務對外的相關連結

本服務提供其他服務之網路連結，您也可經由本服務所提供的連結，點選進入其他服務。但該連結之服務不適用於本服務的隱私權保護政策，您必須參考該連結之服務的隱私權保護政策。


四、服務之停止或終止

1. 本服務如發生下列情形之一時，本團隊有權不經通知逕行停止或中斷提供服務，如因此致用戶或第三人產生困擾、不便或損害，均不負任何法律責任：
對於本服務相關系統設備進行遷移、更換或維護時。
因不可抗力所造成服務之停止或中斷。


五、擔保責任免除及責任限制

本團隊就各項網路資訊服務，不負擔任何明示或默示之擔保責任，亦不保證各項服務之穩定、安全、無誤、及不中斷。
本服務使用者如無法使用本服務時，其所致之任何直接、間接、衍生、或特別損害等，本團隊均不負任何賠償責任。若本服務使用者使用之服務係屬有價者，本團隊僅於本服務使用者所付對價範圍內負賠償責任。但前述賠償責任限制，若依法不得限制者，則限制規定將不予適用。


六、權利歸屬及智慧財產權

本團隊服務上所使用或提供之軟體、程式及內容（包括但不限於文字、說明、圖畫、圖片、圖形、檔案、頁面設計、服務規劃與安排等）之專利權、著作權、商標權、營業秘密、專門技術及其他智慧財產權均屬本團隊或其他權利人所有，非經權利人事先書面授權同意，本服務使用者不得重製、公開傳播、公開播送、公開上映、改作、編輯、出租、散布、進行還原工程、解編、反向組譯、或其他方式之使用，如有違反，除應自行負法律責任外，如因而對本團隊造成損害或損失，本團隊有權向該服務使用者請求損害賠償。
""";
